---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.op_Equality(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCAnyHandle)
source: html/914bfe0a-b7a6-d0be-db08-7ec10295523d.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.op_Equality Method

Determines whether two IFCAnyHandles are the same.

## Syntax (C#)
```csharp
public static bool operator ==(
	IFCAnyHandle first,
	IFCAnyHandle second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The first IFCAnyHandle.
- **second** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The second IFCAnyHandle.

## Returns
True if the IFCAnyHandles are the same; otherwise, false.